templates_servicios/ambiente_prod/SOAP_SGS_PortalTransparencia_input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:val="http://valida.aem.gob.cl" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soapenv:Header/>	
	<soapenv:Body>
		<val:sobre>
         <val:encabezado>
            <val:idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</val:idSobre>			
            <val:fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</val:fechaHora>
            <val:proveedor>               
			   <val:nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</val:nombre>
               <val:servicios>
                  <val:servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</val:servicio>
                  <val:respuestaServicio>
                     <val:estado>SI</val:estado>
                     <val:glosa>RESPUESTA EXITOSA</val:glosa>
                  </val:respuestaServicio>
               </val:servicios>
            </val:proveedor>
            <val:consumidor>
               <val:nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</val:nombre>
               <val:tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</val:tramite>
				<val:certificado>
                  <xd:X509Data>
                     <xd:X509IssuerSerial>
                        <xd:X509IssuerName>IN</xd:X509IssuerName>
                        <xd:X509SerialNumber>0</xd:X509SerialNumber>
                     </xd:X509IssuerSerial>
                  </xd:X509Data>
               </val:certificado>
            </val:consumidor>
            <val:fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora_req']</val:fechaHoraReq>
            <val:emisor>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</val:emisor>
            <val:metadataOperacional>
               <val:estadoSobre>00</val:estadoSobre>
               <val:glosaSobre>REST</val:glosaSobre>
            </val:metadataOperacional>
         </val:encabezado>		
			<val:cuerpo>
				<val:documento>
					<TransparenciaEventoInteroperacionSAI>
						<AltaSaiPortal>
							<IdOrganismo>
								<CodOrganismo>ELPISEE.inputParameter.bodyParameters['p01']</CodOrganismo>
								<DescOrganismo>ELPISEE.inputParameter.bodyParameters['p02']</DescOrganismo>
								<Estado>ELPISEE.inputParameter.bodyParameters['p03']</Estado>
								<PadreOrganismo>ELPISEE.inputParameter.bodyParameters['p04']</PadreOrganismo>
							</IdOrganismo>
							<FormularioSolicitud>
								<Numsolicitud>ELPISEE.inputParameter.bodyParameters['p05']</Numsolicitud>
								<FechaSolicitud>ELPISEE.inputParameter.bodyParameters['p06']</FechaSolicitud>							
								<Solicitante>
									<nombres>ELPISEE.inputParameter.bodyParameters['p07']</nombres>
									<apellidoPaterno>ELPISEE.inputParameter.bodyParameters['p08']</apellidoPaterno>
									<apellidoMaterno>ELPISEE.inputParameter.bodyParameters['p09']</apellidoMaterno>
								</Solicitante>
								<RazonSocial>ELPISEE.inputParameter.bodyParameters['p10']</RazonSocial>
								<Apoderado>
									<nombres>ELPISEE.inputParameter.bodyParameters['p11']</nombres>
									<apellidoPaterno>ELPISEE.inputParameter.bodyParameters['p12']</apellidoPaterno>
									<apellidoMaterno>ELPISEE.inputParameter.bodyParameters['p13']</apellidoMaterno>
								</Apoderado>
								<Email>ELPISEE.inputParameter.bodyParameters['p14']</Email>
								<DireccionPostal>
									<Nombre>ELPISEE.inputParameter.bodyParameters['p15']</Nombre>
									<Numero>ELPISEE.inputParameter.bodyParameters['p16']</Numero>
									<NumeroDepartamentoCasa>ELPISEE.inputParameter.bodyParameters['p17']</NumeroDepartamentoCasa>
									<NumeroTorre>ELPISEE.inputParameter.bodyParameters['p18']</NumeroTorre> 
									<Comuna>
										<CodigoComuna>ELPISEE.inputParameter.bodyParameters['p19']</CodigoComuna>
										<DescripcionComuna>ELPISEE.inputParameter.bodyParameters['p20']</DescripcionComuna>
									</Comuna>
									<Provincia>
										<CodigoProvincia>ELPISEE.inputParameter.bodyParameters['p21']</CodigoProvincia>
										<DescripcionProvincia>ELPISEE.inputParameter.bodyParameters['p22']</DescripcionProvincia>
									</Provincia>
									<Ciudad>ELPISEE.inputParameter.bodyParameters['p23']</Ciudad>
									<Region>
										<CodigoRegion>ELPISEE.inputParameter.bodyParameters['p24']</CodigoRegion>
										<DescripcionRegion>ELPISEE.inputParameter.bodyParameters['p25']</DescripcionRegion>
									</Region>
									<Pais>ELPISEE.inputParameter.bodyParameters['p26']</Pais>
									<CodigoPostal>ELPISEE.inputParameter.bodyParameters['p27']</CodigoPostal>
									<Tipo>ELPISEE.inputParameter.bodyParameters['p28']</Tipo>
									<InformacionAdicional>ELPISEE.inputParameter.bodyParameters['p29']</InformacionAdicional>
								</DireccionPostal>
								<TextoSolicitud>ELPISEE.inputParameter.bodyParameters['p30']</TextoSolicitud>
								<Observaciones>ELPISEE.inputParameter.bodyParameters['p31']</Observaciones>
								<IdFormaRecepcion>ELPISEE.inputParameter.bodyParameters['p32']</IdFormaRecepcion>
								<EmailRecepcion>ELPISEE.inputParameter.bodyParameters['p33']</EmailRecepcion>
								<DireccionPostalRecepcion>
									<Nombre>ELPISEE.inputParameter.bodyParameters['p34']</Nombre>
									<Numero>ELPISEE.inputParameter.bodyParameters['p35']</Numero>
									<NumeroDepartamentoCasa>ELPISEE.inputParameter.bodyParameters['p36']</NumeroDepartamentoCasa>
									<NumeroTorre>ELPISEE.inputParameter.bodyParameters['p37']</NumeroTorre> 
									<Comuna>
										<CodigoComuna>ELPISEE.inputParameter.bodyParameters['p38']</CodigoComuna>
										<DescripcionComuna>ELPISEE.inputParameter.bodyParameters['p39']</DescripcionComuna>
									</Comuna>
									<Provincia>
										<CodigoProvincia>ELPISEE.inputParameter.bodyParameters['p40']</CodigoProvincia>
										<DescripcionProvincia>ELPISEE.inputParameter.bodyParameters['p41']</DescripcionProvincia>
									</Provincia>
									<Ciudad>ELPISEE.inputParameter.bodyParameters['p42']</Ciudad>
									<Region>
										<CodigoRegion>ELPISEE.inputParameter.bodyParameters['p43']</CodigoRegion>
										<DescripcionRegion>ELPISEE.inputParameter.bodyParameters['p44']</DescripcionRegion>
									</Region>
									<Pais>ELPISEE.inputParameter.bodyParameters['p45']</Pais>
									<CodigoPostal>ELPISEE.inputParameter.bodyParameters['p46']</CodigoPostal>
									<Tipo>ELPISEE.inputParameter.bodyParameters['p47']</Tipo>
									<InformacionAdicional>ELPISEE.inputParameter.bodyParameters['p48']</InformacionAdicional>
								</DireccionPostalRecepcion>
							</FormularioSolicitud>
							<IdOficinaRecogida>ELPISEE.inputParameter.bodyParameters['p49']</IdOficinaRecogida>
							<IdFormaEntrega>ELPISEE.inputParameter.bodyParameters['p50']</IdFormaEntrega>
							<ObservacionesFormaEntrega>ELPISEE.inputParameter.bodyParameters['p51']</ObservacionesFormaEntrega>
							<OtraInformacionSai SchemaVersion="1.0">
								<Cantidad>0</Cantidad>
								<ArchivoBinario SchemaVersion="1.0">
									<Nombre/>
									<TipoContenido/>
									<CantidadBytes/>
									<DataCodificada/>
									<Descripcion/>
								</ArchivoBinario>
							</OtraInformacionSai>
						</AltaSaiPortal>
					</TransparenciaEventoInteroperacionSAI>
				</val:documento>
			</val:cuerpo>
		</val:sobre>
	</soapenv:Body>
</soapenv:Envelope>
