rest_services/PROD/SOAP_SRCEI_InformacionPersonalLOBBY_input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"	xmlns:val="http://valida.aem.gob.cl">
	<soapenv:Header/>
	<soapenv:Body>
		<aem:sobre xmlns:aem="http://valida.aem.gob.cl" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
			<aem:encabezado>
				<aem:idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</aem:idSobre>
				<aem:fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</aem:fechaHora>
				<aem:proveedor>
					<aem:nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</aem:nombre>
					<aem:servicios>
						<aem:servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</aem:servicio>
						<aem:respuestaServicio>
							<aem:estado>SI</aem:estado>
							<aem:glosa>Glosa</aem:glosa>
						</aem:respuestaServicio>
					</aem:servicios>
				</aem:proveedor>
				<aem:consumidor>
					<aem:nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</aem:nombre>
					<aem:tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</aem:tramite>
					<aem:certificado>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>IN</ds:X509IssuerName>
								<ds:X509SerialNumber>0</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</aem:certificado>
				</aem:consumidor>
				<aem:fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora_req']</aem:fechaHoraReq>
				<aem:emisor>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</aem:emisor>
				<aem:metadataOperacional>
					<aem:estadoSobre>00</aem:estadoSobre>
					<aem:glosaSobre>REST</aem:glosaSobre>
				</aem:metadataOperacional>
			</aem:encabezado>
			<aem:cuerpo>			
				<aem:documento>
				   <aem:entradaSRCel>
					  <aem:run>
						 <aem:numero>ELPISEE.inputParameter.bodyParameters['rut']</aem:numero>
						 <aem:dv>ELPISEE.inputParameter.bodyParameters['dv']</aem:dv>					 
					  </aem:run>
				   </aem:entradaSRCel>
				</aem:documento>			
			</aem:cuerpo>
		</aem:sobre>
	</soapenv:Body>
</soapenv:Envelope>