Proyectos/api-fiscalizacion/target/classes/velocity/request-pisee.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:val="http://valida.aem.gob.cl" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
		  <soapenv:Header/>
		   <soapenv:Body>
		   <aem:sobre xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:aem="http://valida.aem.gob.cl">
		        <aem:encabezado>
		            <aem:idSobre>120201000120140718000000300</aem:idSobre>
		            <aem:fechaHora>2014-07-18T10:20:32.182125-04:00</aem:fechaHora>
		            <aem:proveedor>
		            <aem:nombre>DIRTRA</aem:nombre>
		          <aem:servicios>
		            <aem:servicio>CERTIFICADO ANTECEDENTES LABORALES PREVISIONALES</aem:servicio>
		           <aem:respuestaServicio>
		             <aem:estado>SI</aem:estado>
		               <aem:glosa>RESPUESTA EXITOSA</aem:glosa>
		            </aem:respuestaServicio>
		          </aem:servicios>
		         </aem:proveedor>
		         <aem:consumidor>
		            <aem:nombre>MOP</aem:nombre>
		            <aem:tramite>REGISTRO DE CONTRATISTAS Y CONSULTORES MOP</aem:tramite>
		            <aem:certificado>
		               <ds:X509Data>
		                  <ds:X509IssuerSerial>
		                     <ds:X509IssuerName>IN</ds:X509IssuerName>
		                     <ds:X509SerialNumber>0</ds:X509SerialNumber>
		                  </ds:X509IssuerSerial>
		               </ds:X509Data>
		            </aem:certificado>
		         </aem:consumidor>
		         <aem:fechaHoraReq>2014-07-18T10:32:32.182125-04:00</aem:fechaHoraReq>
		         <aem:emisor>MOP</aem:emisor>
		         <aem:metadataOperacional>
		            <aem:estadoSobre>00</aem:estadoSobre>
		            <aem:glosaSobre>OK</aem:glosaSobre>
		         </aem:metadataOperacional>
		         </aem:encabezado>
		         <aem:cuerpo>
		            <aem:documento idDocumento="1111">
		               <aem:entradaDT>
		                  <aem:Rut>
		                     <aem:numero>99554700</aem:numero>
		                     <aem:dv>7</aem:dv>
		                  </aem:Rut>
		               </aem:entradaDT>
		            </aem:documento>
		         </aem:cuerpo>
		      </aem:sobre>
		      </soapenv:Body>
</soapenv:Envelope>